[
  {"id":"blasselDrugResistanceMutations2021","abstract":"Drug resistance mutations appear in HIV under treatment pressure. Resistant variants can be transmitted to treatment-naive individuals, which can lead to rapid virological failure and can limit treatment options. Consequently, quantifying the prevalence, emergence and transmission of drug resistance is critical to effectively treating patients and to shape health policies. We review recent bioinformatics developments and in particular describe: (1) the machine learning approaches intended to predict and explain the level of resistance of HIV variants from their sequence data; (2) the phylogenetic methods used to survey the emergence and dynamics of resistant HIV transmission clusters; (3) the impact of deep sequencing in studying within-host and between-host genetic diversity of HIV variants, notably regarding minority resistant variants.","accessed":{"date-parts":[[2021,10,1]]},"author":[{"family":"Blassel","given":"Luc"},{"family":"Zhukova","given":"Anna"},{"family":"Villabona-Arenas","given":"Christian J"},{"family":"Atkins","given":"Katherine E"},{"family":"Hué","given":"Stéphane"},{"family":"Gascuel","given":"Olivier"}],"citation-key":"blasselDrugResistanceMutations2021","container-title":"Current Opinion in Virology","container-title-short":"Current Opinion in Virology","DOI":"10.1016/j.coviro.2021.09.009","ISSN":"1879-6257","issued":{"date-parts":[[2021,12,1]]},"language":"en","page":"56-64","source":"ScienceDirect","title":"Drug resistance mutations in HIV: new bioinformatics approaches and challenges","title-short":"Drug resistance mutations in HIV","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S1879625721001073","volume":"51"},
  {"id":"blasselMappingfriendlySequenceReductions2022b","abstract":"Sequencing errors continue to pose algorithmic challenges to methods working with sequencing data. One of the simplest and most prevalent techniques for ameliorating the detrimental effects of homopolymer expansion/contraction errors present in long reads is homopolymer compression. It collapses runs of repeated nucleotides, to remove some sequencing errors and improve mapping sensitivity. Though our intuitive understanding justifies why homopolymer compression works, it in no way implies that it is the best transformation that can be done. In this paper, we explore if there are transformations that can be applied in the same pre-processing manner as homopolymer compression that would achieve better alignment sensitivity. We introduce a more general framework than homopolymer compression, called mapping-friendly sequence reductions. We transform the reference and the reads using these reductions and then apply an alignment algorithm. We demonstrate that some mapping-friendly sequence reductions lead to improved mapping accuracy, outperforming homopolymer compression.","accessed":{"date-parts":[[2022,10,18]]},"author":[{"family":"Blassel","given":"Luc"},{"family":"Medvedev","given":"Paul"},{"family":"Chikhi","given":"Rayan"}],"citation-key":"blasselMappingfriendlySequenceReductions2022b","container-title":"iScience","container-title-short":"iScience","DOI":"10.1016/j.isci.2022.105305","ISSN":"2589-0042","issued":{"date-parts":[[2022,10,13]]},"language":"en","page":"105305","source":"ScienceDirect","title":"Mapping-friendly sequence reductions: going beyond homopolymer compression","title-short":"Mapping-friendly sequence reductions","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S2589004222015772"},
  {"id":"blasselUsingMachineLearning2021","abstract":"Drug resistance mutations (DRMs) appear in HIV under treatment pressure. DRMs are commonly transmitted to naive patients. The standard approach to reveal new DRMs is to test for significant frequency differences of mutations between treated and naive patients. However, we then consider each mutation individually and cannot hope to study interactions between several mutations. Here, we aim to leverage the ever-growing quantity of high-quality sequence data and machine learning methods to study such interactions (i.e. epistasis), as well as try to find new DRMs. We trained classifiers to discriminate between Reverse Transcriptase Inhibitor (RTI)-experienced and RTI-naive samples on a large HIV-1 reverse transcriptase (RT) sequence dataset from the UK (n ≈ 55, 000), using all observed mutations as binary representation features. To assess the robustness of our findings, our classifiers were evaluated on independent data sets, both from the UK and Africa. Important representation features for each classifier were then extracted as potential DRMs. To find novel DRMs, we repeated this process by removing either features or samples associated to known DRMs. When keeping all known resistance signal, we detected sufficiently prevalent known DRMs, thus validating the approach. When removing features corresponding to known DRMs, our classifiers retained some prediction accuracy, and six new mutations significantly associated with resistance were identified. These six mutations have a low genetic barrier, are correlated to known DRMs, and are spatially close to either the RT active site or the regulatory binding pocket. When removing both known DRM features and sequences containing at least one known DRM, our classifiers lose all prediction accuracy. These results likely indicate that all mutations directly conferring resistance have been found, and that our newly discovered DRMs are accessory or compensatory mutations. Moreover, apart from the accessory nature of the relationships we found, we did not find any significant signal of further, more subtle epistasis combining several mutations which individually do not seem to confer any resistance.","accessed":{"date-parts":[[2021,8,27]]},"author":[{"family":"Blassel","given":"Luc"},{"family":"Tostevin","given":"Anna"},{"family":"Villabona-Arenas","given":"Christian Julian"},{"family":"Peeters","given":"Martine"},{"family":"Hué","given":"Stéphane"},{"family":"Gascuel","given":"Olivier"}],"citation-key":"blasselUsingMachineLearning2021","container-title":"PLOS Computational Biology","container-title-short":"PLOS Computational Biology","DOI":"10.1371/journal.pcbi.1008873","ISSN":"1553-7358","issue":"8","issued":{"date-parts":[[2021,8,26]]},"language":"en","page":"e1008873","publisher":"Public Library of Science","section":"New Results","source":"PLoS Journals","title":"Using machine learning and big data to explore the drug resistance landscape in HIV","type":"article-journal","URL":"https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1008873","volume":"17"},
  {"id":"lemoineCOVIDAlignAccurateOnline2020","abstract":"The first cases of the COVID-19 pandemic emerged in December 2019. Until the end of February 2020, the number of available genomes was below 1,000, and their multiple alignment was easily achieved using standard approaches. Subsequently, the availability of genomes has grown dramatically. Moreover, some genomes are of low quality with sequencing/assembly errors, making accurate re-alignment of all genomes nearly impossible on a daily basis. A more efficient, yet accurate approach was clearly required to pursue all subsequent bioinformatics analyses of this crucial data.hCoV-19 genomes are highly conserved, with very few indels and no recombination. This makes the profile HMM approach particularly well suited to align new genomes, add them to an existing alignment and filter problematic ones. Using a core of ∼2,500 high quality genomes, we estimated a profile using HMMER, and implemented this profile in COVID-Align, a user-friendly interface to be used online or as standalone via Docker. The alignment of 1,000 genomes requires ∼50mn on our cluster. Moreover, COVID-Align provides summary statistics, which can be used to determine the sequencing quality and evolutionary novelty of input genomes (e.g. number of new mutations and indels).https://covalign.pasteur.cloud, hub.docker.com/r/evolbioinfo/covid-alignSupplementary information is available at Bioinformatics online.","accessed":{"date-parts":[[2021,5,23]]},"author":[{"family":"Lemoine","given":"Frédéric"},{"family":"Blassel","given":"Luc"},{"family":"Voznica","given":"Jakub"},{"family":"Gascuel","given":"Olivier"}],"citation-key":"lemoineCOVIDAlignAccurateOnline2020","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btaa871","ISSN":"1367-4803","issue":"12","issued":{"date-parts":[[2020,10,12]]},"page":"1761-1762","source":"Silverchair","title":"COVID-Align: Accurate online alignment of hCoV-19 genomes using a profile HMM","title-short":"COVID-Align","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btaa871","volume":"37"},
  {"id":"zhukovaOriginEvolutionGlobal2021","accessed":{"date-parts":[[2022,2,22]]},"author":[{"family":"Zhukova","given":"Anna"},{"family":"Blassel","given":"Luc"},{"family":"Lemoine","given":"Frédéric"},{"family":"Morel","given":"Marie"},{"family":"Voznica","given":"Jakub"},{"family":"Gascuel","given":"Olivier"}],"citation-key":"zhukovaOriginEvolutionGlobal2021","container-title":"Comptes Rendus. Biologies","DOI":"10.5802/crbiol.29","ISSN":"1768-3238","issue":"1","issued":{"date-parts":[[2021,6,21]]},"page":"57-75","source":"comptes-rendus.academie-sciences.fr","title":"Origin, evolution and global spread of SARS-CoV-2","type":"article-journal","URL":"https://comptes-rendus.academie-sciences.fr/biologies/articles/10.5802/crbiol.29/","volume":"344"}
]
