[
	{
		"id": "http://zotero.org/users/5156025/items/AU9UGQTL",
		"type": "article",
		"abstract": "Phylogenetic inference, the task of reconstructing how related sequences evolved from common ancestors, is a central task in evolutionary genomics. The current state-of-the-art methods exploit probabilistic models of sequence evolution along phylogenetic trees, by searching for the tree maximizing the likelihood of observed sequences, or by estimating the posterior of the tree given the sequences in a Bayesian framework. Both approaches typically require to compute likelihoods, which is only feasible under simplifying assumptions such as independence of the evolution at the different positions of the sequence, and even then remains a costly operation. Here we present Phyloformer 2, the first likelihood-free inference method for posterior distributions over phylogenies. Phyloformer 2 exploits a novel encoding for pairs of sequences that makes it more scalable than previous approaches, and a parameterized probability distribution factorized over a succession of subtree merges. The resulting network provides accurate estimates of the posterior distribution, and outperforms both state-of-the-art maximum likelihood methods and a previous likelihood-free method for point estimation. It opens the way to fast and accurate phylogenetic inference under realistic models of sequence evolution.",
		"DOI": "10.48550/arXiv.2510.12976",
		"note": "arXiv:2510.12976 [q-bio]",
		"number": "arXiv:2510.12976",
		"publisher": "arXiv",
		"source": "arXiv.org",
		"title": "Likelihood-free inference of phylogenetic tree posterior distributions",
		"URL": "http://arxiv.org/abs/2510.12976",
		"author": [
			{
				"family": "Blassel",
				"given": "Luc"
			},
			{
				"family": "Boussau",
				"given": "Bastien"
			},
			{
				"family": "Lartillot",
				"given": "Nicolas"
			},
			{
				"family": "Jacob",
				"given": "Laurent"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					10,
					20
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2025",
					10,
					14
				]
			]
		}
	}
]

